'''
while循环的格式
    while 条件:
        条件满足时，做的事情1
        条件满足时，做的事情2
        条件满足时，做的事情3
        ...(省略)...
'''
# 案列
#  i = 0
#     while i<5:
#         print("当前是第%d次执行循环"%(i+1))
#         print("i=%d"%i)
#         i+=1
'''

1. 计算1~100的累积和（包含1和100）
参考代码如下:
'''
# i = 1
# sum = 0
# while i<=100:
#     sum = sum + i
#     i += 1

# print("1~100的累积和为:%d"%sum)


'''
2. 计算1~100之间偶数的累积和（包含1和100）
参考代码如下:
'''
# i = 1
# sum = 0
# while i<=100:
#     if i%2 == 0:
#         sum = sum + i
#     i+=1

# print("1~100的累积和为:%d"%sum)

'''
while嵌套的格式
    while 条件1:

        条件1满足时，做的事情1
        条件1满足时，做的事情2
        条件1满足时，做的事情3
        ...(省略)...

        while 条件2:
            条件2满足时，做的事情1
            条件2满足时，做的事情2
            条件2满足时，做的事情3
            ...(省略)...
'''
# 案列
'''

while嵌套应用一
要求：打印如下图形：

    *
    * *
    * * *
    * * * *
    * * * * *
'''
#参考代码：
# i = 1
# while i<=5:
#     j = 1
#     while j<=i:
#         print("* ",end='')
#         j+=1

#     print("\n")
#     i+=1

# while嵌套应用二：九九乘法表
i = 1
while i<=9:
    j=1
    while j<=i:
        print("%d*%d=%-2d "%(j,i,i*j),end='')
        j+=1
    print('\n')
    i+=1