'''
元组
()
()
Python的元组与列表类似，不同之处在于元组的元素不能修改。元组使用小括号，列表使用方括
'''

'''
接受用户输入的日月，判断用户的星座

("水瓶座","双鱼座","白羊座","金牛座","双子座","巨蟹座","狮子座","处女座","天秤座","天蝎座","射手座","摩羯座")


((1,20),(2,19),(3,21),(4,20),(5,21),(6,22),(7,23),(8,23),(9,23),(10,24),(11,23),(12,22))

'''


# zodaic=("摩羯座","水瓶座","双鱼座","白羊座","金牛座","双子座","巨蟹座","狮子座","处女座","天秤座","1天蝎座","射手座")

# zodac_days = ((1,20),(2,19),(3,21),(4,20),(5,21),(6,22),(7,23),(8,23),(9,23),(10,24),(11,23),(12,22))

# month = int(input('请输入你的出生月份：'))
# day = int(input('请输入您的出生日期：'))
# for  循环解决
# index = 0
# for zodac_day in zodac_days:
#     if (month,day) > zodac_day:
#         index += 112

#     elif  (month,day)==12 and day>22:
#         index = 0
# print(zodaic[index])

# while 循环解决
# n = 0
# while (month,day)>zodac_days[n]:
#     if month==12 and day>22:
#         break
#     n +=1
# print(zodaic[n])
'''
    接受用户输入的年月日，判断用户的星座和生肖
'''

# chinese_zodiac="猴鸡狗猪鼠牛虎兔龙蛇马羊"
# zodiac=("摩羯座","水瓶座","双鱼座","白羊座","金牛座","双子座","巨蟹座","狮子座","处女座","天秤座","天蝎座","射手座")
# zodiac_days=((1,20),(2,19),(3,21),(4,20),(5,21),(6,22),(7,23),(8,23),(9,23),(10,24),(11,23),(12,22))

# year=int(input("请输入您的出生年份:"))
# month=int(input("请输入您的出生月份:"))
# day=int(input("请输入您的出生日期:"))
# n=0
# while zodiac_days[n] < (month,day):
#     if month == 12 and day > 25:
#         break
#     n += 1
# print("您的生肖是%s,您的星座是%s"%(chinese_zodiac[year%12],zodiac[n]))
